* StudentRec 
01  StudentRec.
    88  EndOfSF VALUE HIGH-VALUES.
    02  StudentNumber         PIC 9(7).
    02  StudentName.
        03 Surname            PIC X(12).
        03 Initials           PIC XX.
    02  CourseCode            PIC X(5).
    02  Gender                PIC X.
